app/controllers/artists_controller.rb

INSERT INTO "artists" ("name", "facebook_link", "intagram_link_string", "spotify_link", "donation_link", "hire_link", "genre", "profile_picture", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @artist = Artist.new(artist_params)

    respond_to do |format|
      if @artist.save

DELETE FROM "artists" WHERE "artists"."id" = $1  [["id", 3]]
---
  def destroy
    @artist.destroy