app/controllers/events_controller.rb

INSERT INTO "events" ("date", "location", "event_picture", "buy_link", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["date", "27/1/2019"], ["location", "Calaf"], ["event_picture", "picture"], ["buy_link", "comprar"], ["created_at", "2019-01-27 14:32:39.004981"], ["updated_at", "2019-01-27 14:32:39.004981"]]
---
  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save